# **Data Preparation**:

In [4]:
#importing libraries 
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.metrics import accuracy_score, classification_report
import pandas as pd
from sklearn.metrics import accuracy_score
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

In [5]:
#loading  and previewing rainfall data sets:
rainfal=pd.read_csv("kenya_rainfall_2022_2024.csv")
rainfal.head()

,time,precipitation_sum (mm),Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,town
0,01/01/2022,0.0,NaN,NaN,NaN,NaN,Nairobi
1,02/01/2022,0.0,NaN,NaN,NaN,NaN,Nairobi
2,03/01/2022,0.0,NaN,NaN,NaN,NaN,Nairobi
3,04/01/2022,0.0,NaN,NaN,NaN,NaN,Nairobi
4,05/01/2022,0.0,NaN,NaN,NaN,NaN,Nairobi

In [6]:
#loading and previewing wfp food prices
foodprices=pd.read_csv('wfp_food_prices_ken.csv')
foodprices.head()

,date,admin1,admin2,market,market_id,latitude,longitude,category,commodity,commodity_id,unit,priceflag,pricetype,currency,price,usdprice
0,#date,#adm1+name,#adm2+name,#loc+market+name,#loc+market+code,#geo+lat,#geo+lon,#item+type,#item+name,#item+code,#item+unit,#item+price+flag,#item+price+type,#currency+code,#value,#value+usd
1,2006-01-15,Coast,Mombasa,Mombasa,191,-4.05,39.67,pulses and nuts,Beans,50,KG,actual,Wholesale,KES,33.63,0.47
2,2006-01-15,Eastern,Kitui,Kitui,187,-1.37,38.02,cereals and tubers,Potatoes (Irish),148,50 KG,actual,Wholesale,KES,1249.99,17.39
3,2006-01-15,Eastern,Kitui,Kitui,187,-1.37,38.02,cereals and tubers,Sorghum,65,90 KG,actual,Wholesale,KES,1800,25.03
4,2006-01-15,Eastern,Kitui,Kitui,187,-1.37,38.02,pulses and nuts,Beans (dry),262,KG,actual,Retail,KES,39,0.54

In [7]:
#loading and previewing cities data:
towns=pd.read_csv('cities_latitude_and_longitudes.csv')
towns.head()

,city,lat,lng,country,iso2,admin_name,capital,population,population_proper
0,Nairobi,-1.2864,36.8172,Kenya,KE,Nairobi City,primary,5545000.0,5545000.0
1,Mombasa,-4.0500,39.6667,Kenya,KE,Mombasa,admin,1208333.0,1200000.0
2,Nakuru,-0.3000,36.0667,Kenya,KE,Nakuru,admin,570674.0,307990.0
3,Eldoret,0.5167,35.2833,Kenya,KE,Uasin Gishu,admin,475716.0,289380.0
4,Kisumu,-0.0833,34.7667,Kenya,KE,Kisumu,admin,409928.0,409928.0